import './Details.css';

export default function Details() {
    return (
        <div class="container">
            <h1 style={{ marginBottom: "1rem" }}>⚡ Проект – Futuristic Design</h1>

            <div class="img-box">
                <img src="https://images.unsplash.com/photo-1558655146-9f40138edfeb" />
            </div>

            <div class="description">
                Това е подробното описание на проекта. Тук авторът може да обясни идеята, процеса на работа, използваните
                технологии и вдъхновението зад дизайна. Целта е потребителите да разберат повече за проекта и да оценят
                усилията зад него.

            </div>
            <a href="#" class="project-link">🔗 Виж проекта на живо</a>

            <button class="likes-btn">❤️ Харесай</button>
        </div>
    );
}